// 1. Базові програми. Командний рядок.

/*
Завдання для самостійної роботи
[B]01.01, 
[B]01.02, 
[B]01.03,
[B]01.04,
[B]01.05 
*/

// Вивести в консоль підказку «Введіть ім’я». 
// Ввести його з консолі та вивести повідомлення «Привіт, ***». 
// Скомпілювати програму через командний рядок
// за допомогою команди javac і запустіть її за допомогою java.

// Програма запитує ім'я користувача та виводить привітання в консоль.

import java.util.Scanner;

public class B01_01 {

    public static void main(String[] args) {
        // об'єкт Scanner для зчитування вводу з консолі
        Scanner scanner = new Scanner(System.in);

        // 1. Вивести в консоль підказку «Введіть ім’я»
        System.out.print("Enter name: ");

        // 2. Ввести його з консолі
        String name = scanner.nextLine();

        // 3. Вивести повідомлення «Привіт, ***»
        System.out.println("Hello, " + name + "!");

        // щоб уникнути витоку ресурсів
        scanner.close();
    }

}